app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.order(:rating).distinct.pluck(:rating)
    @movies = Movie.all
    @sort = params[:sort] || session[:sort]
    session[:sort] = @sort

    if params[:ratings]
      @ratings = params[:ratings].keys
      session[:ratings] = @ratings
    elsif session[:ratings]
      @ratings = session[:ratings]
    else
      @ratings = @all_ratings
    end


      @movies = Movie.where(:rating => @ratings).order(@sort)
---
SELECT DISTINCT "movies"."rating" FROM "movies"  ORDER BY "movies"."rating" ASC
SELECT "movies".* FROM "movies" WHERE (rating IN (NULL))
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'PG-13', 'R')  ORDER BY release_date